Docs: atualização do readme com mermaid
